Autodesk.Navisworks.Api.Data.NavisworksParameter
Implementation of DbParameter.

Autodesk.Navisworks.Api.Data.NavisworksParameter.#ctor
Default constructor

Autodesk.Navisworks.Api.Data.NavisworksParameter.#ctor(System.String,System.Object)
Constructs a named parameter given the specified parameter name and initial value
parameterName: The parameter name
value: The initial value of the parameter

Autodesk.Navisworks.Api.Data.NavisworksParameter.DbType
Returns the datatype of the parameter

Autodesk.Navisworks.Api.Data.NavisworksParameter.Direction
Supports only input parameters

Autodesk.Navisworks.Api.Data.NavisworksParameter.IsNullable
Whether or not the parameter can contain a null value

Autodesk.Navisworks.Api.Data.NavisworksParameter.ParameterName
Returns the parameter name

Autodesk.Navisworks.Api.Data.NavisworksParameter.Size
Returns the size of the parameter

Autodesk.Navisworks.Api.Data.NavisworksParameter.SourceColumn
Gets/sets the source column

Autodesk.Navisworks.Api.Data.NavisworksParameter.SourceColumnNullMapping
Used by DbCommandBuilder to determine the mapping for nullable fields

Autodesk.Navisworks.Api.Data.NavisworksParameter.SourceVersion
Gets and sets the row version

Autodesk.Navisworks.Api.Data.NavisworksParameter.Value
Gets and sets the parameter value.  If no datatype was specified, the datatype will assume the type from the value given.